# Hospital Management System

## Project Overview
This project implements a comprehensive SQL database for a hospital management system. It tracks patients, doctors, appointments, medical tests, prescriptions, and insurance claims.

In [2]:
%load_ext sql

## Database Schema & Table Definitions

### Tables Created:
1. **Patients** - Stores patient demographics and contact information
2. **Doctors** - Maintains doctor details and specialties
3. **Appointments** - Tracks patient-doctor appointments with status
4. **Prescriptions** - Records medications prescribed during appointments
5. **MedicalTests** - Catalog of available medical tests and costs
6. **PatientTests** - Tracks test history and results for each patient
7. **InsuranceClaims** - Manages insurance claim processing

### Key Features:
- Primary keys on all tables for uniqueness
- Foreign key relationships for data integrity

In [3]:
# Create a connection to hospital.db
%sql sqlite:///hospital.db

Create Table Patients,Doctors,Appointments,Prescription,MedicalTests,PatientTests,Insuranceclaims

In [ ]:
%%sql
CREATE TABLE Patients (
    patient_id INT PRIMARY KEY,
    full_name VARCHAR(100),
    gender VARCHAR(10),
    date_of_birth DATE,
    contact_number VARCHAR(20),
    registration_date DATE
);
CREATE TABLE Doctors (
    doctor_id INT PRIMARY KEY,
    full_name VARCHAR(100),
    specialty VARCHAR(50),
    joining_date DATE
);

CREATE TABLE Appointments (
    appointment_id INT PRIMARY KEY,
    patient_id INT,
    doctor_id INT,
    appointment_date DATETIME,
    status VARCHAR(20),   -- Scheduled, Completed, Cancelled are the types of status
    FOREIGN KEY (patient_id) REFERENCES Patients(patient_id),
    FOREIGN KEY (doctor_id) REFERENCES Doctors(doctor_id)
);
CREATE TABLE Prescriptions (
    prescription_id INT PRIMARY KEY,
    appointment_id INT,
    medicine_name VARCHAR(100),
    dosage VARCHAR(50),
    duration_days INT,
    FOREIGN KEY (appointment_id) REFERENCES Appointments(appointment_id)
);
CREATE TABLE MedicalTests (
    test_id INT PRIMARY KEY,
    test_name VARCHAR(100),
    cost DECIMAL(10,2)
);
CREATE TABLE PatientTests (
    patient_test_id INT PRIMARY KEY,
    patient_id INT,
    test_id INT,
    test_date DATE,
    result VARCHAR(255),
    FOREIGN KEY (patient_id) REFERENCES Patients(patient_id),
    FOREIGN KEY (test_id) REFERENCES MedicalTests(test_id)
);
CREATE TABLE InsuranceClaims (
    claim_id INT PRIMARY KEY,
    patient_id INT,
    claim_amount DECIMAL(10,2),
    claim_date DATE,
    status VARCHAR(20),   -- Approved, Pending, Rejected are the types of status
    FOREIGN KEY (patient_id) REFERENCES Patients(patient_id)
);

 * sqlite:///hospital.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### Patients Table

In [ ]:
%%sql 
-- 1. INSERT DATA FOR Patients
INSERT INTO Patients (patient_id, full_name, gender, date_of_birth, contact_number, registration_date)
VALUES
(1, 'John Doe', 'Male', '1980-05-14', '9876543210', '2023-01-12'),
(2, 'Aisha Khan', 'Female', '1992-11-22', '9988776655', '2023-03-05'),
(3, 'Michael Smith', 'Male', '1975-02-10', '9123456780', '2022-12-20'),
(4, 'Rita Sharma', 'Female', '1988-07-09', '9876001122', '2023-04-18'),
(5, 'Arjun Mehta', 'Male', '2000-06-18', '9001234567', '2023-05-11');

 * sqlite:///hospital.db
5 rows affected.

[]

### Doctors Table

In [8]:
%%sql
INSERT INTO Doctors (doctor_id, full_name, specialty, joining_date)
VALUES
(1, 'Dr. Priya Menon', 'Cardiology', '2021-01-10'),
(2, 'Dr. Rahul Gupta', 'Dermatology', '2020-05-15'),
(3, 'Dr. Sarah Lee', 'Endocrinology', '2022-02-20'),
(4, 'Dr. David Clark', 'Orthopedics', '2019-11-11'),
(5, 'Dr. Meera Singh', 'General Medicine', '2023-01-05');

 * sqlite:///hospital.db
5 rows affected.

[]

### Appointments Table

In [9]:
%%sql
INSERT INTO Appointments (appointment_id, patient_id, doctor_id, appointment_date, status)
VALUES
(1, 1, 1, '2024-01-10 10:30:00', 'Completed'),
(2, 1, 3, '2024-02-12 14:00:00', 'Completed'),
(3, 2, 5, '2024-03-01 09:00:00', 'Scheduled'),
(4, 3, 2, '2024-01-25 15:45:00', 'Cancelled'),
(5, 4, 4, '2024-02-05 11:00:00', 'Completed'),
(6, 5, 5, '2024-02-20 16:30:00', 'Completed');

 * sqlite:///hospital.db
6 rows affected.

[]

### Prescriptions Table

In [10]:
%%sql
INSERT INTO Prescriptions (prescription_id, appointment_id, medicine_name, dosage, duration_days)
VALUES
(1, 1, 'Aspirin', '75mg', 30),
(2, 1, 'Atorvastatin', '10mg', 60),
(3, 2, 'Metformin', '500mg', 90),
(4, 5, 'Ibuprofen', '400mg', 10),
(5, 6, 'Vitamin B12', '500mcg', 45);

 * sqlite:///hospital.db
5 rows affected.

[]

### Medical Tests Table

In [11]:
%%sql
INSERT INTO MedicalTests (test_id, test_name, cost)
VALUES
(1, 'Blood Sugar Test', 250.00),
(2, 'Lipid Profile', 900.00),
(3, 'Thyroid Panel', 650.00),
(4, 'X-Ray', 500.00),
(5, 'MRI Scan', 4500.00);

 * sqlite:///hospital.db
5 rows affected.

[]

### Patient Tests Table

In [12]:
%%sql
INSERT INTO PatientTests (patient_test_id, patient_id, test_id, test_date, result)
VALUES
(1, 1, 1, '2024-01-10', 'Normal'),
(2, 1, 2, '2024-02-12', 'High Cholesterol'),
(3, 2, 3, '2024-03-01', 'TSH Slightly High'),
(4, 3, 4, '2024-01-25', 'No Fracture Detected'),
(5, 4, 1, '2024-02-05', 'Slightly High'),
(6, 5, 5, '2024-02-20', 'Normal MRI');

 * sqlite:///hospital.db
6 rows affected.

[]

### Insurance Claims Table

In [14]:
%%sql
INSERT INTO InsuranceClaims (claim_id, patient_id, claim_amount, claim_date, status)
VALUES
(1, 1, 5000.00, '2024-02-15', 'Approved'),
(2, 2, 12000.00, '2024-03-05', 'Pending'),
(3, 3, 8000.00, '2024-01-30', 'Rejected'),
(4, 4, 9500.00, '2024-02-10', 'Approved'),
(5, 5, 4000.00, '2024-02-25', 'Pending');

 * sqlite:///hospital.db
5 rows affected.

[]

Select Operation

In [17]:
%%sql
Select * from Patients;

 * sqlite:///hospital.db
Done.

[(1, 'John Doe', 'Male', '1980-05-14', '9876543210', '2023-01-12'),
 (2, 'Aisha Khan', 'Female', '1992-11-22', '9988776655', '2023-03-05'),
 (3, 'Michael Smith', 'Male', '1975-02-10', '9123456780', '2022-12-20'),
 (4, 'Rita Sharma', 'Female', '1988-07-09', '9876001122', '2023-04-18'),
 (5, 'Arjun Mehta', 'Male', '2000-06-18', '9001234567', '2023-05-11')]

In [7]:
%%sql
Select * from doctors;

 * sqlite:///hospital.db
Done.

[(1, 'Dr. Priya Menon', 'Cardiology', '2021-01-10'),
 (2, 'Dr. Rahul Gupta', 'Dermatology', '2020-05-15'),
 (3, 'Dr. Sarah Lee', 'Endocrinology', '2022-02-20'),
 (4, 'Dr. David Clark', 'Orthopedics', '2019-11-11'),
 (5, 'Dr. Meera Singh', 'General Medicine', '2023-01-05')]

Here Select * is used while selecting data from tables which is not the ideal way to extract data we should only extract required fields, this improves the perfomance and make sql more reliable.

In [21]:
%%sql
select patient_id,full_name 
from
Patients;

 * sqlite:///hospital.db
Done.

[(1, 'John Doe'),
 (2, 'Aisha Khan'),
 (3, 'Michael Smith'),
 (4, 'Rita Sharma'),
 (5, 'Arjun Mehta')]

### Filter
If we want to filter data in sql then we can use where 
It is used to extract records that fulfill a specified conditions.

Select name of patients whose gender is male

In [26]:
%%sql
Select patient_id,full_name 
from
patients
where gender="Male";

 * sqlite:///hospital.db
Done.

[(1, 'John Doe'), (3, 'Michael Smith'), (5, 'Arjun Mehta')]

Show patients who have been registered recently

In [8]:
%%sql
select full_name
from
patients
order by registration_date DESC;

 * sqlite:///hospital.db
Done.

[('Arjun Mehta',),
 ('Rita Sharma',),
 ('Aisha Khan',),
 ('John Doe',),
 ('Michael Smith',)]

### Joins
Joins are used to combine rows from two or more tables based on a related (common) column.
They allow us to retrieve meaningful information by linking data that is stored separately.

Types of Join
- Inner Join 
- Left Join
- Right Join 
- Full Join

Get all appointments with patient and doctor names

In [9]:
%%sql
Select 
      a.appointment_id,
      p.full_name as patinet_name,
      d.full_name as doctor_name,
      a.appointment_date
      from 
      appointments a
      join patients p on a.patient_id=p.patient_id
      join doctors d on a.doctor_id=d.doctor_id;

 * sqlite:///hospital.db
Done.

[(1, 'John Doe', 'Dr. Priya Menon', '2024-01-10 10:30:00'),
 (2, 'John Doe', 'Dr. Sarah Lee', '2024-02-12 14:00:00'),
 (3, 'Aisha Khan', 'Dr. Meera Singh', '2024-03-01 09:00:00'),
 (4, 'Michael Smith', 'Dr. Rahul Gupta', '2024-01-25 15:45:00'),
 (5, 'Rita Sharma', 'Dr. David Clark', '2024-02-05 11:00:00'),
 (6, 'Arjun Mehta', 'Dr. Meera Singh', '2024-02-20 16:30:00')]

List all the Tests taken by patient

In [ ]:
%%sql
Select 
        pt.patient_test_id,
        p.full_name as patient_name,
        mt.test_name,
        pt.test_date,
        pt.result
    from PatientTests pt
    join Patients p on pt.patient_id = p.patient_id
    join MedicalTests mt on pt.test_id = mt.test_id;

 * sqlite:///hospital.db
Done.

[(1, 'John Doe', 'Blood Sugar Test', '2024-01-10', 'Normal'),
 (2, 'John Doe', 'Lipid Profile', '2024-02-12', 'High Cholesterol'),
 (3, 'Aisha Khan', 'Thyroid Panel', '2024-03-01', 'TSH Slightly High'),
 (4, 'Michael Smith', 'X-Ray', '2024-01-25', 'No Fracture Detected'),
 (5, 'Rita Sharma', 'Blood Sugar Test', '2024-02-05', 'Slightly High'),
 (6, 'Arjun Mehta', 'MRI Scan', '2024-02-20', 'Normal MRI')]

Display patient names and the total cost of all tests they have taken.

In [12]:
%%sql
select 
    p.full_name,sum(m.cost) as total_test_cost
    from patients p 
    join patienttests pt
    on p.patient_id = pt.patient_id
    join 
    medicaltests m
    on 
    m.test_id = pt.test_id
    group by pt.patient_id,p.full_name;

 * sqlite:///hospital.db
Done.

[('John Doe', 1150),
 ('Aisha Khan', 650),
 ('Michael Smith', 500),
 ('Rita Sharma', 250),
 ('Arjun Mehta', 4500)]

Show patients who never booked an appointment

In [19]:
%%sql
Select 
      p.full_name as patient_name
      from 
      patients p 
      left join appointments a on p.patient_id=a.patient_id
      where appointment_id IS NULL;

 * sqlite:///hospital.db
Done.

[('Hari Bahadur',)]

Count number of appointments doctor has. 
- Here in this query we will be using group by to count the number of appointments that each doctor has

In [5]:
%%sql
Select 
        d.full_name as doctor_name,
        count(*) as total_appointments
        from Doctors d
        left join Appointments a on d.doctor_id=a.doctor_id
        group by d.doctor_id,d.full_name;

 * sqlite:///hospital.db
Done.

[('Dr. Priya Menon', 1),
 ('Dr. Rahul Gupta', 1),
 ('Dr. Sarah Lee', 1),
 ('Dr. David Clark', 1),
 ('Dr. Meera Singh', 2)]

Show name of patients including their insurance claims

In [8]:
%%sql
     Select 
     p.full_name as patient_name,
     ic.claim_amount
     from 
     patients p
     join insuranceclaims ic on p.patient_id=ic.patient_id;

 * sqlite:///hospital.db
Done.

[('John Doe', 5000),
 ('Aisha Khan', 12000),
 ('Michael Smith', 8000),
 ('Rita Sharma', 9500),
 ('Arjun Mehta', 4000)]

### Right Join
Here we can use Right join using 2 technique one using Right join and other by using leftjoin only but reversing the order of tables.

Select all doctors, even those who havenâ€™t had appointments yet.

In [ ]:
%%sql
-- Using Right join 
SELECT 
    d.full_name AS doctor_name,
    a.appointment_id,
    a.patient_id,
    a.appointment_date
FROM 
    appointments a
RIGHT JOIN doctors d ON a.doctor_id = d.doctor_id;

 * sqlite:///hospital.db
Done.

[('Dr. Priya Menon', 1, 1, '2024-01-10 10:30:00'),
 ('Dr. Sarah Lee', 2, 1, '2024-02-12 14:00:00'),
 ('Dr. Meera Singh', 3, 2, '2024-03-01 09:00:00'),
 ('Dr. Rahul Gupta', 4, 3, '2024-01-25 15:45:00'),
 ('Dr. David Clark', 5, 4, '2024-02-05 11:00:00'),
 ('Dr. Meera Singh', 6, 5, '2024-02-20 16:30:00')]

Count number of Appointment taken by patient and display only record of patient who have multiple appointment

In [5]:
%%sql 
Select p.patient_id,p.full_name,
count(*) as total_appointments
from patients p
join appointments a on p.patient_id=a.patient_id
group by p.patient_id,p.full_name
having total_appointments>1;

 * sqlite:///hospital.db
Done.

[(1, 'John Doe', 2)]

Count number of male and female patients

In [10]:
%%sql
Select 
  sum(case when gender='Male' then 1 else 0 end) as male_count,
  sum(case when gender='Female' then 1 else 0 end) as female_count
  from patients;

 * sqlite:///hospital.db
Done.

[(4, 2)]

List doctors who have never had a cancelled appointment.

In [16]:
%%sql
Select 
     d.doctor_id,d.full_name as doctor_name
     from doctors d
     left join appointments a on d.doctor_id=a.doctor_id and a.status = 'Cancelled' 
     where a.appointment_id IS NULL;

 * sqlite:///hospital.db
Done.

[(1, 'Dr. Priya Menon'),
 (3, 'Dr. Sarah Lee'),
 (4, 'Dr. David Clark'),
 (5, 'Dr. Meera Singh')]

Find the doctor(s) with the highest number of completed appointments.

In [ ]:
%%sql
SELECT 
    d.full_name AS doctor_name,
    COUNT(a.appointment_id) AS total_appointments
FROM Doctors d
LEFT JOIN Appointments a 
    ON d.doctor_id = a.doctor_id 
    AND a.status = 'Completed'
GROUP BY d.doctor_id, d.full_name
ORDER BY total_appointments DESC, d.full_name;

 * sqlite:///hospital.db
Done.

[('Dr. David Clark', 1),
 ('Dr. Meera Singh', 1),
 ('Dr. Priya Menon', 1),
 ('Dr. Sarah Lee', 1)]

Find the top 3 patients who have spent the most on medical tests

In [ ]:
%%sql
Select 
      p.full_name as patient_name,
      sum(m.cost) as total_cost
      from 
      patients p 
      join
      PatientTests pt 
      on pt.patient_id = p.patient_id
      join medicalTests m 
      on pt.test_id = m.test_id
      group by p.patient_id,patient_name
      order by total_cost desc
      limit 3;

 * sqlite:///hospital.db
Done.

[('Arjun Mehta', 4500), ('John Doe', 1150), ('Aisha Khan', 650)]

In [19]:
%%sql
ALTER TABLE InsuranceClaims
ADD COLUMN claim_start_date DATE;

ALTER TABLE InsuranceClaims
ADD COLUMN claim_end_date DATE;

 * sqlite:///hospital.db
Done.
Done.

[]

In [ ]:
%%sql
UPDATE InsuranceClaims
SET claim_start_date = '2025-01-01',
    claim_end_date = '2025-12-31';

 * sqlite:///hospital.db
5 rows affected.

[]